#include <string>

using namespace std;

const string varnmala[] = {
    // Vowels: hasv, dirgh, pluta
    // 1, 2, 3
    "अ", "आ", "आा", 
    // 4, 5, 6
    "इ", "ई", "ईी", 
    // 7, 8, 9
    "उ", "ऊ", "ऊू", 
    // 10, 11, 12
    "ऋ", "ॠ", "ॠॄ", 
    // 13, 14, 15
    "ळ", "ळु" ,"ळू",
    // 16, 17, 18
    "ए", "एा", "एाा", 
    // 19, 20, 21
    "ऐ", "ऐो", "ऐोो", 
    // 22, 23, 24
    "ओ", "ओो", "ओोो", 
    // 25, 26, 27
    "औ", "औौ", "औौौ",

    // Grouped consonants
    // 28, 29, 30, 31, 32
    "क्", "ख्", "ग्", "घ्", "ङ्",
    // 33, 34, 35, 36, 37
    "च्", "छ्", "ज्", "झ्", "ञ्",
    // 38, 39, 40, 41, 42
    "ट्", "ठ्", "ड्", "ढ्", "ण्",
    // 43, 44, 45, 46, 47
    "त्", "थ्", "द्", "ध्", "न्",
    // 48, 49, 50, 51, 52
    "प्", "फ्", "ब्", "भ्", "म्",
    // 53, 54, 55, 56, 57
    "य्", "र्", "ल्", "व्", "श्",

    // Un-grouped consonants
    // 58, 59, 60
    "ष्", "स्", "ह्"

    // Special characters
    // 61, 62, 63, 64
    "ं", "ः", "...", "::"
};