namespace SiriBhuvalyaExtractor.Extractor;

public static class Constants
{
    public static string[] devnagri = {
        "अ", "आ", "आा", "इ", "ई", "ईी", "उ", "ऊ", "ऊू", "ऋ", "ॠ", "ॠॄ", "ळ्", "ळु", "ळू", "ए", "एा", "एाा", "ऐ", "ऐो", "ऐोो", "ओ", "ओो", "ओोो", "औ", "औौ", "औौौ",
        "क्", "ख्", "ग्", "घ्", "ङ्", "च्", "छ्", "ज्", "झ्", "ञ्", "ट्", "ठ्", "ड्", "ढ्", "ण्", "त्", "थ्", "द्", "ध्", "न्", "प्", "फ्", "ब्", "भ्", "म्", "य्", "र्", "ल्", "व्", "श्",
        "ष्", "स्", "ह्", "ं", "ः", "…", "::",
        "क़्", "ख़्", "ग़्", "ज़्", "ड़्", "ढ़्", "फ़्", "य़्", "ऴ्", "ऩ्", "ऴ", "ऱ्", "ऍ", "ऑ", "ऎ", "ऒ", "ऌ", "ॡ"
    };
    
    public static string[] kannadaScriptCharacters = new string[] {
        "ಅ", "ಆ", "ಆಾ", "ಇ", "ಈ", "ಈೀ", "ಉ", "ಊ", "ಊೂ", "ಋ", "ೠ", "ೠೄ",
        "ಳ್", "ಳು", "ಳೂ", "ಎ", "ಏ", "ಏೋ", "ಐ", "ಐೖ", "ಐೖೖ", "ಒ", "ಓ", "ಓೋ",
        "ಔ", "ಔೌ", "ಔೌೌ", "ಕ್", "ಖ್", "ಗ್", "ಘ್", "ಙ್", "ಚ್", "ಛ್", "ಜ್",
        "ಝ್", "ಞ್", "ಟ್", "ಠ್", "ಡ್", "ಢ್", "ಣ್", "ತ್", "ಥ್", "ದ್", "ಧ್", "ನ್",
        "ಪ್", "ಫ್", "ಬ್", "ಭ್", "ಮ್", "ಯ್", "ರ್", "ಲ್", "ವ್", "ಶ್", "ಷ್", "ಸ್",
        "ಹ್", "ಂ", "ಃ", "...", "::", ":", "ೞ್", "ಱ್"
    };
}